In [3]:
import pandas as pd
import numpy as np

In [12]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
f = pd.DataFrame({"A":ser.index, "B":ser.to_list()})
print(f)

    A   B
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

In [17]:
ser1 = pd.Series([1,2,3])
ser2 = pd.Series(["A", "B", "C"])
pd.concat([ser1,ser2], axis=1)

   0  1
0  1  A
1  2  B
2  3  C

In [23]:
pd.DataFrame({'Date':pd.date_range('2000-01-01', freq='W-SAT', periods = 10),
              'random':np.random.normal(0,1,size=(10))})

        Date    random
0 2000-01-01 -0.099196
1 2000-01-08  0.793383
2 2000-01-15 -1.506930
3 2000-01-22 -0.020153
4 2000-01-29  0.891266
5 2000-02-05  1.273438
6 2000-02-12 -1.224150
7 2000-02-19 -1.389812
8 2000-02-26  0.340504
9 2000-03-04 -0.625450

In [24]:
ser = pd.Series([np.nan,1,10,3], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

In [26]:
print(ser)

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [27]:
ser.ffill()

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     3.0
dtype: float64